{
  "tadabbur_surah": [
    {
      "surah_no": 18,
      "nama": "Al-Kahfi",
      "ulasan_ringkas": "Mengandungi 4 kisah utama (Ashabul Kahfi, Pemilik Kebun, Nabi Musa & Khidir, serta Dzulkarnain) yang mengajar tentang ujian iman, harta, ilmu, dan kuasa.",
      "pengajaran": "Kepentingan mencari perlindungan Allah daripada fitnah dunia dan akhir zaman."
    },
    {
      "surah_no": 32,
      "nama": "As-Sajadah",
      "ulasan_ringkas": "Menegaskan tentang penciptaan manusia, hari kebangkitan, dan perbezaan antara orang yang beriman dengan orang yang fasik.",
      "pengajaran": "Keagungan sujud dan tunduk kepada perintah Allah sebagai hamba."
    },
    {
      "surah_no": 36,
      "nama": "Yaasin",
      "ulasan_ringkas": "Dikenali sebagai 'Jantung Al-Quran'. Menekankan tentang kebenaran wahyu, utusan Allah, dan bukti kekuasaan Allah dalam menghidupkan semula yang mati.",
      "pengajaran": "Kesedaran tentang kehidupan selepas mati dan tanggungjawab terhadap amalan di dunia."
    },
    {
      "surah_no": 55,
      "nama": "Ar-Rahmaan",
      "ulasan_ringkas": "Gaya bahasa yang puitis dengan pengulangan ayat 'Nikmat Tuhanmu yang manakah yang kamu dustakan?' sebagai teguran kepada jin dan manusia.",
      "pengajaran": "Mensyukuri segala nikmat zahir dan batin yang Allah kurniakan tanpa henti."
    },
    {
      "surah_no": 56,
      "nama": "Al-Waqi'ah",
      "ulasan_ringkas": "Menceritakan tentang tiga golongan manusia di hari kiamat: Golongan Kanan, Golongan Kiri, dan As-Sabiqun (orang yang paling awal beriman).",
      "pengajaran": "Kepastian berlakunya hari kiamat dan ganjaran bagi setiap amal perbuatan."
    },
    {
      "surah_no": 67,
      "nama": "Al-Mulk",
      "ulasan_ringkas": "Membuktikan kekuasaan Allah dalam mentadbir alam semesta dan ujian hidup untuk melihat siapa yang paling baik amalannya.",
      "pengajaran": "Sentiasa merasa diawasi oleh Allah (Muraqabah) dalam setiap keadaan."
    },
    {
      "surah_no": 76,
      "nama": "Al-Insan",
      "ulasan_ringkas": "Menceritakan sejarah penciptaan manusia daripada setitis air sehingga dijanjikan syurga bagi mereka yang bersabar dan memberi makan orang miskin.",
      "pengajaran": "Sifat pemurah dan kesabaran adalah kunci utama menuju syurga."
    },
    {
      "surah_no": 112,
      "nama": "Al-Ikhlas",
      "ulasan_ringkas": "Asas tauhid yang paling murni. Menjelaskan sifat Allah yang Esa, tempat bergantung, tidak beranak dan tidak diperanakkan.",
      "pengajaran": "Memurnikan akidah daripada sebarang bentuk syirik."
    }
  ]
}
